#include "smg.h"
/** 
 **  @brief    定时器测试延时精度
 **  @author   QIU
 **  @data     2023.08.31
 **/

/*-------------------------------------------------------------------*/


void time0_init(){
	TMOD |= 0x01;   // 配置定时器0工作方式为16位定时器
	TH0 = TL0 = 0;  // 初值设置为0
	TR0 = 1;        // 开启定时器
}



void main(){
	u16 num;             			// 存放计数器的值
	
	time0_init();        			// 定时器初始化
	delay_ms(1);         			// 延时
	num = (TH0 << 8) + TL0;  			// 得到此时定时器的值
	
	while(1){
		// 显示计数次数
		smg_showInt(num, 1);
	}
}


